app/views/publicacions/_form.html.erb

SELECT "ciudads".* FROM "ciudads"
---
    <%= form.label :ciudad %>
    <%= form.select :ciudad, Ciudad.all.collect{|p| p.nombre}, id: :publicacion_ciudad %>