app/controllers/ciudads_controller.rb

SELECT "ciudads".* FROM "ciudads" WHERE (nombre LIKE '%%')
SELECT "ciudads".* FROM "ciudads"
---
  def index
    if params[:search]
      @ciudads = Ciudad.where('nombre LIKE ?',"%#{params[:search]}%")
    else
      @ciudads = Ciudad.all

INSERT INTO "ciudads" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-09-14 21:31:19.310308"], ["updated_at", "2018-09-14 21:31:19.310308"]]
---
  def create
    @ciudad = Ciudad.new(ciudad_params)

    respond_to do |format|
      if @ciudad.save

DELETE FROM "ciudads" WHERE "ciudads"."id" = $1  [["id", 1]]
---
  def destroy
    @ciudad.destroy

SELECT  "ciudads".* FROM "ciudads" WHERE "ciudads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ciudad
      @ciudad = Ciudad.find(params[:id])