app/controllers/pais_controller.rb

SELECT "pais".* FROM "pais" WHERE (nombre LIKE '%Chile%')
---
  def index
    @pais = Pai.all

INSERT INTO "pais" ("nombre", "descripcion", "suscriptores", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Chile"], ["descripcion", "adwcawc"], ["suscriptores", 1], ["created_at", "2018-09-14 21:20:12.140136"], ["updated_at", "2018-09-14 21:20:12.140136"]]
---
  def create
    @pai = Pai.new(pai_params)

    respond_to do |format|
      if @pai.save

DELETE FROM "pais" WHERE "pais"."id" = $1  [["id", 4]]
---
  def destroy
    @pai.destroy

SELECT  "pais".* FROM "pais" WHERE "pais"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_pai
      @pai = Pai.find(params[:id])