app/controllers/publicacions_controller.rb

  def index
    if params[:search]
      @publicacions = Publicacion.where('titulo LIKE ? OR ciudad LIKE ?',"%#{params[:search]}%", "%#{params[:search]}%")
    else
      @publicacions = Publicacion.all
---
SELECT "publicacions".* FROM "publicacions" WHERE (titulo LIKE '%aa%' OR ciudad LIKE '%aa%')
SELECT "publicacions".* FROM "publicacions"

  def create
    @publicacion = Publicacion.new(publicacion_params)

    respond_to do |format|
      if @publicacion.save
---
INSERT INTO "publicacions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-09-14 21:18:35.328428"], ["updated_at", "2018-09-14 21:18:35.328428"]]

  def destroy
    @publicacion.destroy
---
DELETE FROM "publicacions" WHERE "publicacions"."id" = $1  [["id", 1]]

    def set_publicacion
      @publicacion = Publicacion.find(params[:id])
---
SELECT  "publicacions".* FROM "publicacions" WHERE "publicacions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]